# VisibleLayersOnly Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseImportOptions..::..VisibleLayersOnly Property
BaseImportOptions Class See Also
---
Only import the visible layers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool VisibleLayersOnly { get; set; }
```

Visual Basic
---
```text
Public Property VisibleLayersOnly As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool VisibleLayersOnly {
	bool get ();
	void set (bool value);
}
```

# Remarks
If this option is set to true, only visible layers are imported. For dgn import, this option is unsupported.
# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace